In [5]:
# Import Library
import sqlite3
import pandas as pd

In [10]:
 # Database in memory
conn=sqlite3.connect(":memory:")
# Cursor for commands SQL
cursor = conn.cursor()

In [20]:
# Create TABLE called "empleados" with colums; id, nombre, edad, salario
cursor.execute(
    """CREATE TABLE empleados (
        id INTEGER PRIMARY KEY,
        nombre TEXT NOT NULL,
        edad INTEGER NOT NULL,
        salario INTEGER NOT NULL
    )"""
)

In [21]:
# Create a list with data of employes (id, nombre, etc)
empleados = (
    (1, "ana", 28, 45000),
    (2, "luis", 35, 52000),
    (3, "sofia", 40, 60000)
)

In [ ]:
# Insert data in TABLE
cursor.executemany("INSERT INTO empleados VALUES (?, ?, ?, ?)", empleados)
# Save Changes
conn.commit()

In [37]:
# Query empleados with salario > 50000 with SQL
consulta = pd.read_sql_query("SELECT * FROM empleados WHERE salario > 50000", conn)

# Print
print(consulta)

   id nombre  edad  salario
0   2   luis    35    52000
1   3  sofia    40    60000